COPTER_MODES = {
    0: '自稳', 1: '特技', 2: '定高', 3: '自动', 4: '引导',
    5: '悬停', 6: '返航', 7: '绕圈', 9: '降落', 16: '定点', 21: '智能返航',
}
PLANE_MODES = {
    0: '手动', 1: '绕圈', 2: '自稳', 5: '辅助A', 6: '辅助B', 7: '巡航',
    10: '自动', 11: '返航', 12: '盘旋', 15: '引导',
    17: '旋翼自稳', 18: '旋翼悬停', 19: '旋翼定点', 20: '旋翼降落', 21: '旋翼返航',
}
COPTER_BTNS = [[0, '自稳'], [2, '定高'], [5, '悬停'], [3, '自动'], [6, '返航'], [9, '降落']]
PLANE_BTNS = [
    [19, '旋翼定点'], [18, '旋翼悬停'], [17, '旋翼自稳'],
    [10, '自动'], [21, '旋翼返航'], [20, '旋翼降落'], [12, '盘旋'], [11, '返航'],
]
FIX_NAMES = {0: '无定位', 1: '无定位', 2: '2D', 3: '3D', 4: '差分', 5: 'RTK浮动', 6: 'RTK固定'}
